---
kind: method
id: M:Autodesk.Revit.DB.Plumbing.PipingSystem.IsFlowServerMissing
source: html/bfdbd8f4-f15a-e58b-2bd0-473d75f9fa6c.htm
---
# Autodesk.Revit.DB.Plumbing.PipingSystem.IsFlowServerMissing Method

Indicates if any flow server which was used in the piping system is not available.

## Syntax (C#)
```csharp
public bool IsFlowServerMissing()
```

## Returns
True if there is any flow server not available, false otherwise.